MAVProxyUser/OpenPilotESP32-WROOM-32E/targets/esp32wroom/esp-idf/sdkconfig.defaults
# NinjaPilot esp32wroom -- ESP-IDF configuration.
#
# Every non-obvious line here is a deliberate choice; please read the comment
# before changing one.

CONFIG_IDF_TARGET="esp32"

# --- CPU ---------------------------------------------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Dynamic frequency scaling OFF. It adds latency to every critical section
# and varies the clock underneath a control loop. (The ArduPilot ESP32 port
# leaves this ON for the original ESP32 and OFF for the S3, which looks like
# an oversight rather than a decision.)
CONFIG_PM_ENABLE=n

# SINGLE CORE for this first bring-up. This is the cheap way to get what we
# actually want -- the whole flight path on one core with no SMP semantics --
# without auditing every xTaskCreate in the tree for pinning. It also sidesteps
# the Xtensa FPU/core-affinity interaction entirely.
#
# Turning this off later is how you get core 1 for WiFi and telemetry. Do that
# only after going through task creation deliberately; do not just flip it.
CONFIG_FREERTOS_UNICORE=y

# --- Flash -------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Performance -------------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Keep the SPI master in IRAM: the gyro read is the hottest path on the board
# and we do not want it stalling on a flash cache miss.
CONFIG_SPI_MASTER_IN_IRAM=y

# --- Watchdogs: ON -----------------------------------------------------
# Deliberately enabled. The PiOS flag scheme in pios_wdg.c sits on top of the
# task WDT, so a single stalled flight task takes the board down instead of
# letting it fly on stale commands.
#
# The timeout must be LONGER than PIOS_WATCHDOG_TIMEOUT (250ms in
# pios_board.h) or the hardware fires before PiOS gets a chance to.
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=2
# CONFIG_ESP_TASK_WDT_PANIC is deliberately left unset for now, which means a
# stalled task is LOGGED but does not reset the board -- weaker than the intent
# described at the top of pios/esp32/pios_wdg.c. Detection itself is verified
# working: injecting a flag bit nothing ever sets trips the watchdog 2.0s later
# and names the task.
#
# Arm it (=y) once the xTaskCreate stack-size bug is fixed -- ESP-IDF sizes task
# stacks in BYTES where the shared modules pass words, so every flight task runs
# on a quarter of its intended stack, and the resulting memory corruption shows
# up as intermittent panics in telemetryRxTask and runNextCallback. Arming the
# watchdog before that is fixed would turn those into in-flight resets.
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_INT_WDT=y

# --- FreeRTOS ----------------------------------------------------------
CONFIG_FREERTOS_HZ=1000

# This tree predates FreeRTOS v8's type rename and still uses xTaskHandle,
# xQueueHandle and xSemaphoreHandle throughout (pios_rcvr.h, pios_task_monitor.h,
# uavobjectmanager.h, every generated UAVObject header...). The vendored
# V11.3.0 kernel provides the old spellings; IDF's build turns them off by
# default, so turn them back on rather than churning hundreds of files in
# shared flight code.
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y
# The tree's other targets need configMAX_PRIORITIES >= 8; IDF's default of 25
# is comfortably above that, so nothing to set.
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y

# --- Diagnostics -------------------------------------------------------
# A core dump to flash is how you find out what a crash on the bench was.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y

# --- Not used (yet) ----------------------------------------------------
CONFIG_BT_ENABLED=n

# --- Bring-up diagnostics (turn off once stable) ------------------------
# Comprehensive poisoning checks the canaries around every allocation on
# free and on every heap operation, so a buffer overrun is reported at the
# point of corruption rather than surfacing later as a wild pointer.
CONFIG_HEAP_POISONING_COMPREHENSIVE=y
CONFIG_HEAP_TRACING_STANDALONE=n

# --- Console OFF UART0 -------------------------------------------------
# UART0 carries UAVTalk to the GCS. Leaving IDF's console on it interleaves
# log text into the middle of UAVTalk frames; the receiver then reports
# "failed CRC check" in a loop and the link never establishes. pyuavtalk
# silently drops the bad frames and limps along, which is why this looked
# like flaky request/reply rather than corruption -- the GCS is stricter and
# simply never links.
#
# The console moves to UART1 on GPIO13/14, which nothing else on this board
# uses. Boot log and panics are still reachable with a second USB-serial
# adapter on GPIO13; UART0 is left to PIOS alone.
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_CUSTOM_NUM_1=y
# 22/23 are the Qwiic I2C pins, unused here. NOT 13/14 -- 14 is the IMU
# chip select on this board.
CONFIG_ESP_CONSOLE_UART_TX_GPIO=22
CONFIG_ESP_CONSOLE_UART_RX_GPIO=23
